// data/grid-variables.ts

export const VariableMap: { [key: string]: string } = {
    // แถว 1 (R1)
    'R1C1': 'ฤทธี / อัตตะ',
    'R1C2': 'เถื่อนกำบัง / หินะ',
    'R1C3': 'พวนเรือโยง / ธะนัง',
    'R1C4': 'ฟ้างำดิน / ปิตา',
    'R1C5': 'ชูพิษแสลง / มาตา',
    'R1C6': 'เย้าให้ผอม / โภคา',
    'R1C7': 'ฟ้าสนั่นเสียง / มัฌฌิมา',
    
    // แถว 2 (R2)
    'R2C1': 'สีหจักร / ตนุ',
    'R2C2': 'พังภูผา / กดุมภะ',
    'R2C3': 'โพงน้ำป่า / สหัชชะ',
    'R2C4': 'อินทร์พิมาน / พันธุ',
    'R2C5': 'แข็งให้อ่อน / ปุตตะ',
    'R2C6': 'จอมปราสาท / อริ', 
    'R2C7': 'เรียงหลักยืน / ปัตนิ', 
    
    // แถว 3 (R3)
    'R3C1': 'ลักษณ์ซ่อนเงื่อน / มรณะ',
    'R3C2': 'ม้ากินสวน / ศุภะ',
    'R3C3': 'ล่อช้างป่า / กำมะ',
    'R3C4': 'ผลาญศัตรู / ลาภะ',
    'R3C5': 'ยอนภูเขา / พยายะ',
    'R3C6': 'ราชปัญญา / ทาสี',
    'R3C7': 'ปืนพระราม / ทาสา',
};
