// src/data/grid-variables.ts

export const VariableMap: { [key: string]: string } = {
    // --- แถว 1 (R1) ---
    'R1C1': 'ฤทธี / อัตตะ / เกษตร 5 / คุณนาม 1',
    'R1C2': 'เถื่อนกำบัง / หินะ / เกษตร 8 (1,6) / คุณนาม 0',
    'R1C3': 'พวนเรือโยง / ธะนัง / เกษตร 6 / คุณนาม 4',
    'R1C4': 'ฟ้างำดิน / ปิตา / เกษตร 1 / คุณนาม x',
    'R1C5': 'ชูพิษแสลง / มาตา / เกษตร 2 / คุณนาม x',
    'R1C6': 'เย้าให้ผอม / โภคา / เกษตร 3 / คุณนาม 7',
    'R1C7': 'ฟ้าสนั่นเสียง / มัฌฌิมา / เกษตร 4 / คุณนาม x',

    // --- แถว 2 (R2) ---
    'R2C1': 'สีหจักร / ตนุ / เกษตร 3 / คุณนาม 2',
    'R2C2': 'พังภูผา / กดุมภะ / เกษตร 6 / คุณนาม x',
    'R2C3': 'โพงน้ำบ่อ / สหัชชะ / เกษตร 4 / คุณนาม 5',
    'R2C4': 'อินทร์พิมาน / พันธุ / เกษตร 2 / คุณนาม x',
    'R2C5': 'แข็งให้อ่อน / ปุตตะ / เกษตร 1 / คุณนาม x',
    'R2C6': 'จอมปราสาท / อริ / เกษตร 4 / คุณนาม 8',
    'R2C7': 'เรียงหลักยืน / ปัตนิ / เกษตร 6 / คุณนาม x',

    // --- แถว 3 (R3) ---
    'R3C1': 'ลักษณ์ซ่อนเงื่อน / มรณะ / เกษตร 3 / คุณนาม 3',
    'R3C2': 'ม้ากินสวน / ศุภะ / เกษตร 5 / คุณนาม x',
    'R3C3': 'ล่อช้างป่า / กำมะ / เกษตร 7 (9) / คุณนาม 6',
    'R3C4': 'ผลาญศัตรู / ลาภะ / เกษตร 7 (8) / คุณนาม x',
    'R3C5': 'ยอนภูเขา / พยายะ / เกษตร 5 / คุณนาม x',
    'R3C6': 'ราชปัญญา / ทาสี / เกษตร 7 / คุณนาม 9',
    'R3C7': 'ปืนพระราม / ทาสา / เกษตร 7 / คุณนาม x',
};